## Series

In [9]:
from pandas import Series

import pandas as pd

Obj = Series([67, 78, 49, -97])

Obj2 = Series([67, 78, 49, -97], index=["a", "b", "c", "d"])

# indexing poderoso
Obj2[Obj2 > 49]

a    67
b    78
dtype: int64

In [10]:
Obj2["d"]

-97

In [12]:
"d" in Obj2

True

In [23]:
dicio = {"AA":9090, "BB":7812, "CC":1293, "DD":2134}
obj3 = Series(dicio)
obj3

AA    9090
BB    7812
CC    1293
DD    2134
dtype: int64

In [24]:
esportes = ["AA", "BB", "CC", "EE"]
obj4= Series(dicio, index=esportes)
obj4

AA    9090.0
BB    7812.0
CC    1293.0
EE       NaN
dtype: float64

In [26]:
pd.isnull(obj4)

AA    False
BB    False
CC    False
EE     True
dtype: bool

In [28]:
pd.notnull(obj4)

AA     True
BB     True
CC     True
EE    False
dtype: bool

In [30]:
obj4.isnull()

AA    False
BB    False
CC    False
EE     True
dtype: bool

In [32]:
obj3 + obj4

AA    18180.0
BB    15624.0
CC     2586.0
DD        NaN
EE        NaN
dtype: float64

In [36]:
obj4.name = "TESTE"
obj4.index.name = "Label"
obj4

Label
AA    9090.0
BB    7812.0
CC    1293.0
EE       NaN
Name: TESTE, dtype: float64

## DataFrame

In [44]:
from pandas import DataFrame

data = {"Estado": ["SC", "PR", "GO", "BH", "MG"],
        "Ano": [2002, 2004, 2006, 2008, 2010],
        "Pop": [1.5, 1.4, 1.6, 1.8, 2.9]}

frame = DataFrame(data)

frame

  Estado   Ano  Pop
0     SC  2002  1.5
1     PR  2004  1.4
2     GO  2006  1.6
3     BH  2008  1.8
4     MG  2010  2.9

In [86]:
frame = DataFrame(data, columns=["Estado", "Ano", "Pop", "Multa"], index=["a", "b", "c", "d", "e"])

frame

  Estado   Ano  Pop Multa
a     SC  2002  1.5   NaN
b     PR  2004  1.4   NaN
c     GO  2006  1.6   NaN
d     BH  2008  1.8   NaN
e     MG  2010  2.9   NaN

In [87]:
frame["Estado"]

a    SC
b    PR
c    GO
d    BH
e    MG
Name: Estado, dtype: object

In [88]:
frame.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [89]:
frame.values

array([['SC', 2002, 1.5, nan],
       ['PR', 2004, 1.4, nan],
       ['GO', 2006, 1.6, nan],
       ['BH', 2008, 1.8, nan],
       ['MG', 2010, 2.9, nan]], dtype=object)

In [90]:
frame.columns

Index(['Estado', 'Ano', 'Pop', 'Multa'], dtype='object')

In [91]:
frame[:2]

  Estado   Ano  Pop Multa
a     SC  2002  1.5   NaN
b     PR  2004  1.4   NaN

In [92]:
frame.Pop

a    1.5
b    1.4
c    1.6
d    1.8
e    2.9
Name: Pop, dtype: float64

### Numpy e Pandas

In [93]:
import numpy as np

In [94]:
frame["Multa"] = np.arange(5.)
frame

  Estado   Ano  Pop  Multa
a     SC  2002  1.5    0.0
b     PR  2004  1.4    1.0
c     GO  2006  1.6    2.0
d     BH  2008  1.8    3.0
e     MG  2010  2.9    4.0

In [95]:
frame.describe()

               Ano       Pop     Multa
count     5.000000  5.000000  5.000000
mean   2006.000000  1.840000  2.000000
std       3.162278  0.610737  1.581139
min    2002.000000  1.400000  0.000000
25%    2004.000000  1.500000  1.000000
50%    2006.000000  1.600000  2.000000
75%    2008.000000  1.800000  3.000000
max    2010.000000  2.900000  4.000000

In [96]:
frame['b' : 'd']

  Estado   Ano  Pop  Multa
b     PR  2004  1.4    1.0
c     GO  2006  1.6    2.0
d     BH  2008  1.8    3.0

In [103]:
frame.loc['a']

Estado      SC
Ano       2002
Pop        1.5
Multa        0
Name: a, dtype: object

In [106]:
frame.iloc[1]

Estado      PR
Ano       2004
Pop        1.4
Multa        1
Name: b, dtype: object